layer {
	name: "Left_168"
	type: "DummyData"
	top: "Left_168"
	dummy_data_param {
		shape {
			dim: 1
			dim: 6
			dim: 94
			dim: 168
		}
	}
}

layer {
	name: "conv1_1X1_cones"
	type: "Convolution"
	bottom: "Left_168"
	top: "conv1_1X1_cones"
	convolution_param {
		num_output: 3
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}

layer {
	name: "conv1_1X1_cones_pool"
	type: "Pooling"
	bottom: "conv1_1X1_cones"
	top: "conv1_1X1_cones_pool"
	pooling_param {
		pool: AVE
		kernel_size: 3
		stride: 1
		pad_h: 1
		pad_w: 1
	}
}

layer {
	name: "conv1_1X1_pool"
	type: "Convolution"
	bottom: "conv1_1X1_cones_pool"
	top: "conv1_1X1_pool"
	convolution_param {
		num_output: 3
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}

layer {
  name: "conv1_cone_concat"
  type: "Concat"
  bottom: "conv1_1X1_cones"
  bottom: "conv1_1X1_pool"
  top: "conv1_cone_concat"
  concat_param {
    axis: 1
  }     
}


layer {
	name: "rgc_0"
	type: "Convolution"
	bottom: "conv1_cone_concat"
	top: "rgc_0"
	convolution_param {
		num_output: 12
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "rgc_0_relu"
	type: "ReLU"
	bottom: "rgc_0"
	top: "rgc_0"
}

layer {
	name: "rgc_1"
	type: "Convolution"
	bottom: "rgc_0"
	top: "rgc_1"
	convolution_param {
		num_output: 12
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "rgc_1_relu"
	type: "ReLU"
	bottom: "rgc_1"
	top: "rgc_1"
}


layer {
	name: "V1_IV_3x3"
	type: "Convolution"
	bottom: "rgc_1"
	top: "V1_IV_3x3"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 3
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V1_IV_3x3_relu"
	type: "ReLU"
	bottom: "V1_IV_3x3"
	top: "V1_IV_3x3"
}
layer {
	name: "V1_IV_3x3_pool"
	type: "Pooling"
	bottom: "V1_IV_3x3"
	top: "V1_IV_3x3_pool"
	pooling_param {
		pool: MAX
		kernel_size: 5
		stride: 3
		pad_h: 0
		pad_w: 0
	}
}

layer {
	name: "V1_IV_5x5"
	type: "Convolution"
	bottom: "rgc_1"
	top: "V1_IV_5x5"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 5
		stride: 3
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V1_IV_5x5_relu"
	type: "ReLU"
	bottom: "V1_IV_5x5"
	top: "V1_IV_5x5"
}
layer {
	name: "V1_IV_7x7"
	type: "Convolution"
	bottom: "rgc_1"
	top: "V1_IV_7x7"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 7
		stride: 3
		pad_h: 0
		pad_w: 1
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V1_IV_7x7_relu"
	type: "ReLU"
	bottom: "V1_IV_7x7"
	top: "V1_IV_7x7"
}


layer {
  name: "V1_IV_concat"
  type: "Concat"
  bottom: "V1_IV_3x3_pool"
  bottom: "V1_IV_5x5"
  bottom: "V1_IV_7x7"
  top: "V1_IV_concat"
  concat_param {
    axis: 1
  }     
}

layer {
	name: "V1_IV_surround_nin_0"
	type: "Convolution"
	bottom: "V1_IV_concat"
	top: "V1_IV_surround_nin_0"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V1_IV_surround_nin_0_relu"
	type: "ReLU"
	bottom: "V1_IV_surround_nin_0"
	top: "V1_IV_surround_nin_0"
}
layer {
	name: "V1_IV_surround_nin_1"
	type: "Convolution"
	bottom: "V1_IV_concat"
	top: "V1_IV_surround_nin_1"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V1_IV_surround_nin_1_relu"
	type: "ReLU"
	bottom: "V1_IV_surround_nin_1"
	top: "V1_IV_surround_nin_1"
}

layer {
	name: "V1_IV_center_nin_0"
	type: "Convolution"
	bottom: "V1_IV_concat"
	top: "V1_IV_center_nin_0"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V1_IV_center_nin_0_relu"
	type: "ReLU"
	bottom: "V1_IV_center_nin_0"
	top: "V1_IV_center_nin_0"
}

layer {
	name: "V1_IV_center_nin_1"
	type: "Convolution"
	bottom: "V1_IV_concat"
	top: "V1_IV_center_nin_1"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V1_IV_center_nin_1_relu"
	type: "ReLU"
	bottom: "V1_IV_center_nin_1"
	top: "V1_IV_center_nin_1"
}

layer {
	name: "V1_IV_surround_pool"
	type: "Pooling"
	bottom: "V1_IV_surround_nin_1"
	top: "V1_IV_surround_pool"
	pooling_param {
		pool: AVE
		kernel_size: 3
		stride: 1
		pad_h: 1
		pad_w: 1
	}
}
layer {
	name: "V1_IV_surround_pool_relu"
	type: "ReLU"
	bottom: "V1_IV_surround_pool"
	top: "V1_IV_surround_pool"
}

layer {
  name: "V1_concat"
  type: "Concat"
  bottom: "V1_IV_center_nin_1"
  bottom: "V1_IV_surround_pool"
  top: "V1_concat"
  concat_param {
    axis: 1
  }     
}

layer {
	name: "V1_nin_0"
	type: "Convolution"
	bottom: "V1_concat"
	top: "V1_nin_0"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V1_nin_0_relu"
	type: "ReLU"
	bottom: "V1_nin_0"
	top: "V1_nin_0"
}
layer {
	name: "V1_nin_1"
	type: "Convolution"
	bottom: "V1_nin_0"
	top: "V1_nin_1"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V1_nin_1_relu"
	type: "ReLU"
	bottom: "V1_nin_1"
	top: "V1_nin_1"
}




layer {
	name: "V2_IV_3x3"
	type: "Convolution"
	bottom: "V1_nin_1"
	top: "V2_IV_3x3"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 3
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V2_IV_3x3_relu"
	type: "ReLU"
	bottom: "V2_IV_3x3"
	top: "V2_IV_3x3"
}

layer {
	name: "V2_IV_3x3_pool"
	type: "Pooling"
	bottom: "V2_IV_3x3"
	top: "V2_IV_3x3_pool"
	pooling_param {
		pool: MAX
		kernel_size: 5
		stride: 3
		pad_h: 0
		pad_w: 0
	}
}
layer {
	name: "V2_IV_3x3_pool_relu"
	type: "ReLU"
	bottom: "V2_IV_3x3_pool"
	top: "V2_IV_3x3_pool"
}

layer {
	name: "V2_IV_5x5"
	type: "Convolution"
	bottom: "V1_nin_1"
	top: "V2_IV_5x5"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 5
		stride: 3
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V2_IV_5x5_relu"
	type: "ReLU"
	bottom: "V2_IV_5x5"
	top: "V2_IV_5x5"
}
layer {
	name: "V2_IV_7x7"
	type: "Convolution"
	bottom: "V1_nin_1"
	top: "V2_IV_7x7"
	convolution_param {
		num_output: 32
		group: 1
		kernel_size: 7
		stride: 3
		pad_h: 1
		pad_w: 1
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "V2_IV_7x7_relu"
	type: "ReLU"
	bottom: "V2_IV_7x7"
	top: "V2_IV_7x7"
}