input: "data"
input_shape {
  dim: 1
  dim: 1
  dim: 4096
}
input: "dummy"
input_shape {
  dim: 1
  dim: 1
}

layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "data"
  top: "ip2"
  inner_product_param {
      num_output: 1
      weight_filler {
          type: "xavier"
      }
  }
}

layer {
  name: "lstm1"
  type: "LSTM"
  bottom: "data"
  bottom: "ip2"
  top: "lstm1"
  recurrent_param {
    num_output: 256
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "fc8-final"
  type: "InnerProduct"
  bottom: "lstm1"
  top: "fc8-final"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 101
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    axis: 2
  }
}
layer {
  name: "probs"
  type: "Softmax"
  bottom: "fc8-final"
  top: "probs"
  softmax_param {
    axis: 2
  }
}
