



layer {
	name: "steer_motor_target_data"
	type: "DummyData"
	top: "steer_motor_target_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 60
		}
	}
}



layer {
	name: "input_data"
	type: "DummyData"
	top: "input_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 1
			dim: 5
			dim: 150
		}
	}
}


	
###################### Convolutional Layer Set 'conv1' ######################
#
layer {
	name: "conv1"
	type: "Convolution"
	bottom: "input_data"
	top: "conv1"
	convolution_param {
		num_output: 96
		group: 1
		kernel_h: 5
		kernel_w: 15
		stride: 3
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
	
layer {
	name: "conv1_relu"
	type: "ReLU"
	bottom: "conv1"
	top: "conv1"
}
	
#layer {
#	name: "conv1_pool"
#	type: "Pooling"
#	bottom: "conv1"
#	top: "conv1_pool"
#	pooling_param {
#		pool: MAX
#		kernel_size: 3
#		stride: 1
#		pad: 0
#	}
#}
	
############################################################

layer {
	name: "conv2"
	type: "Convolution"
	bottom: "conv1"
	top: "conv2"
	convolution_param {
		num_output: 256
		group: 2
		kernel_h: 1
		kernel_w: 3
		stride: 2
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}





###################### IP Layer Set 'ip1' ######################
#
layer {
	name: "ip1"
	type: "InnerProduct"
	bottom: "conv2"
	top: "ip1"
	inner_product_param {
		num_output: 512
		weight_filler {
			type: "xavier" 
		}
	}
}
	
layer {
	name: "ip1_relu"
	type: "ReLU"
	bottom: "ip1"
	top: "ip1"
}
	
############################################################


###################### IP Layer Set 'ip2' ######################
#
layer {
	name: "ip2"
	type: "InnerProduct"
	bottom: "ip1"
	top: "ip2"
	inner_product_param {
		num_output: 60
		weight_filler {
			type: "xavier" 
		}
	}
}
	
#layer {
#	name: "ip2_relu"
#	type: "ReLU"
#	bottom: "ip2"
#	top: "ip2"
#}
	
############################################################


layer {
	name: "euclidean"
	type: "EuclideanLoss"
	bottom: "ip2"
	bottom: "steer_motor_target_data"
	top: "euclidean"
	loss_weight: 1
}
	
