#### layer 0 ####
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00392156862745
  }
  data_param {
    source: "caffe/data/mnist/mnist_train_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00392156862745
  }
  data_param {
    source: "caffe/data/mnist/mnist_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  type: 'Python'
  name: 'pydata'
  bottom: 'data'
  top: 'pydata'
  python_param {
    module: 'kz_layers0'
    layer: 'SimpleLayer2'
  }
  include {
    phase: TRAIN
  }
}
layer {
  type: 'Python'
  name: 'pydata'
  bottom: 'data'
  top: 'pydata'
  python_param {
    module: 'kz_layers0'
    layer: 'SimpleLayer2'
  }
  include {
    phase: TEST
  }
}

#### layer 1 ####


	layer {
	  name: "ic1_hid"
	  type: "Convolution"
	  	bottom: 'pydata' 
	  top: "ic1_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic1_hid_relu"
	  type: "ReLU"
	  bottom: "ic1_hid"
	  top: "ic1_hid"
	}
	layer {
	  name: "ic1_out"
	  type: "Convolution"
	  bottom: "ic1_hid"
	  top: "ic1_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic1_out_relu"
	  type: "ReLU"
	  bottom: "ic1_out"
	  top: "ic1_out"
	}
	
#### layer 2 ####

	layer {
	  name: "ic2_in"
	  type: "Concat"
	  	bottom: 'ic1_hid'
  		bottom: 'ic1_out' 
	  top: "ic2_in"
	}
	layer {
	  name: "ic2_hid"
	  type: "Convolution"
	  bottom: "ic2_in"
	  top: "ic2_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic2_hid_relu"
	  type: "ReLU"
	  bottom: "ic2_hid"
	  top: "ic2_hid"
	}
	layer {
	  name: "ic2_out"
	  type: "Convolution"
	  bottom: "ic2_hid"
	  top: "ic2_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic2_out_relu"
	  type: "ReLU"
	  bottom: "ic2_out"
	  top: "ic2_out"
	}
	
#### layer 3 ####

	layer {
	  name: "ic3_in"
	  type: "Concat"
	  	bottom: 'ic1_out'
  		bottom: 'ic2_hid'
  		bottom: 'ic2_out' 
	  top: "ic3_in"
	}
	layer {
	  name: "ic3_hid"
	  type: "Convolution"
	  bottom: "ic3_in"
	  top: "ic3_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic3_hid_relu"
	  type: "ReLU"
	  bottom: "ic3_hid"
	  top: "ic3_hid"
	}
	layer {
	  name: "ic3_out"
	  type: "Convolution"
	  bottom: "ic3_hid"
	  top: "ic3_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic3_out_relu"
	  type: "ReLU"
	  bottom: "ic3_out"
	  top: "ic3_out"
	}
	
#### layer 4 ####

	layer {
	  name: "ic4_in"
	  type: "Concat"
	  	bottom: 'ic1_out'
  		bottom: 'ic2_out'
  		bottom: 'ic3_hid'
  		bottom: 'ic3_out' 
	  top: "ic4_in"
	}
	layer {
	  name: "ic4_hid"
	  type: "Convolution"
	  bottom: "ic4_in"
	  top: "ic4_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic4_hid_relu"
	  type: "ReLU"
	  bottom: "ic4_hid"
	  top: "ic4_hid"
	}
	layer {
	  name: "ic4_out"
	  type: "Convolution"
	  bottom: "ic4_hid"
	  top: "ic4_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic4_out_relu"
	  type: "ReLU"
	  bottom: "ic4_out"
	  top: "ic4_out"
	}
	
#### layer 5 ####

	layer {
	  name: "ic5_in"
	  type: "Concat"
	  	bottom: 'ic2_out'
  		bottom: 'ic3_out'
  		bottom: 'ic4_hid'
  		bottom: 'ic4_out' 
	  top: "ic5_in"
	}
	layer {
	  name: "ic5_hid"
	  type: "Convolution"
	  bottom: "ic5_in"
	  top: "ic5_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic5_hid_relu"
	  type: "ReLU"
	  bottom: "ic5_hid"
	  top: "ic5_hid"
	}
	layer {
	  name: "ic5_out"
	  type: "Convolution"
	  bottom: "ic5_hid"
	  top: "ic5_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic5_out_relu"
	  type: "ReLU"
	  bottom: "ic5_out"
	  top: "ic5_out"
	}
	
#### layer 6 ####

	layer {
	  name: "ic6_in"
	  type: "Concat"
	  	bottom: 'ic3_out'
  		bottom: 'ic4_out'
  		bottom: 'ic5_hid'
  		bottom: 'ic5_out' 
	  top: "ic6_in"
	}
	layer {
	  name: "ic6_hid"
	  type: "Convolution"
	  bottom: "ic6_in"
	  top: "ic6_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic6_hid_relu"
	  type: "ReLU"
	  bottom: "ic6_hid"
	  top: "ic6_hid"
	}
	layer {
	  name: "ic6_out"
	  type: "Convolution"
	  bottom: "ic6_hid"
	  top: "ic6_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic6_out_relu"
	  type: "ReLU"
	  bottom: "ic6_out"
	  top: "ic6_out"
	}
	
#### layer 7 ####

	layer {
	  name: "ic7_in"
	  type: "Concat"
	  	bottom: 'ic4_out'
  		bottom: 'ic5_out'
  		bottom: 'ic6_hid'
  		bottom: 'ic6_out' 
	  top: "ic7_in"
	}
	layer {
	  name: "ic7_hid"
	  type: "Convolution"
	  bottom: "ic7_in"
	  top: "ic7_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic7_hid_relu"
	  type: "ReLU"
	  bottom: "ic7_hid"
	  top: "ic7_hid"
	}
	layer {
	  name: "ic7_out"
	  type: "Convolution"
	  bottom: "ic7_hid"
	  top: "ic7_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic7_out_relu"
	  type: "ReLU"
	  bottom: "ic7_out"
	  top: "ic7_out"
	}
	
#### layer 8 ####

	layer {
	  name: "ic8_in"
	  type: "Concat"
	  	bottom: 'ic5_out'
  		bottom: 'ic6_out'
  		bottom: 'ic7_hid'
  		bottom: 'ic7_out' 
	  top: "ic8_in"
	}
	layer {
	  name: "ic8_hid"
	  type: "Convolution"
	  bottom: "ic8_in"
	  top: "ic8_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic8_hid_relu"
	  type: "ReLU"
	  bottom: "ic8_hid"
	  top: "ic8_hid"
	}
	layer {
	  name: "ic8_out"
	  type: "Convolution"
	  bottom: "ic8_hid"
	  top: "ic8_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic8_out_relu"
	  type: "ReLU"
	  bottom: "ic8_out"
	  top: "ic8_out"
	}
	
#### layer 9 ####

	layer {
	  name: "ic9_in"
	  type: "Concat"
	  	bottom: 'ic6_out'
  		bottom: 'ic7_out'
  		bottom: 'ic8_hid'
  		bottom: 'ic8_out' 
	  top: "ic9_in"
	}
	layer {
	  name: "ic9_hid"
	  type: "Convolution"
	  bottom: "ic9_in"
	  top: "ic9_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic9_hid_relu"
	  type: "ReLU"
	  bottom: "ic9_hid"
	  top: "ic9_hid"
	}
	layer {
	  name: "ic9_out"
	  type: "Convolution"
	  bottom: "ic9_hid"
	  top: "ic9_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic9_out_relu"
	  type: "ReLU"
	  bottom: "ic9_out"
	  top: "ic9_out"
	}
	
#### layer 10 ####

	layer {
	  name: "ic10_in"
	  type: "Concat"
	  	bottom: 'ic7_out'
  		bottom: 'ic8_out'
  		bottom: 'ic9_hid'
  		bottom: 'ic9_out' 
	  top: "ic10_in"
	}
	layer {
	  name: "ic10_hid"
	  type: "Convolution"
	  bottom: "ic10_in"
	  top: "ic10_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic10_hid_relu"
	  type: "ReLU"
	  bottom: "ic10_hid"
	  top: "ic10_hid"
	}
	layer {
	  name: "ic10_out"
	  type: "Convolution"
	  bottom: "ic10_hid"
	  top: "ic10_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic10_out_relu"
	  type: "ReLU"
	  bottom: "ic10_out"
	  top: "ic10_out"
	}
	
#### layer 11 ####

	layer {
	  name: "ic11_in"
	  type: "Concat"
	  	bottom: 'ic8_out'
  		bottom: 'ic9_out'
  		bottom: 'ic10_hid'
  		bottom: 'ic10_out' 
	  top: "ic11_in"
	}
	layer {
	  name: "ic11_hid"
	  type: "Convolution"
	  bottom: "ic11_in"
	  top: "ic11_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic11_hid_relu"
	  type: "ReLU"
	  bottom: "ic11_hid"
	  top: "ic11_hid"
	}
	layer {
	  name: "ic11_out"
	  type: "Convolution"
	  bottom: "ic11_hid"
	  top: "ic11_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic11_out_relu"
	  type: "ReLU"
	  bottom: "ic11_out"
	  top: "ic11_out"
	}
	
#### layer 12 ####

	layer {
	  name: "ic12_in"
	  type: "Concat"
	  	bottom: 'ic9_out'
  		bottom: 'ic10_out'
  		bottom: 'ic11_hid'
  		bottom: 'ic11_out' 
	  top: "ic12_in"
	}
	layer {
	  name: "ic12_hid"
	  type: "Convolution"
	  bottom: "ic12_in"
	  top: "ic12_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic12_hid_relu"
	  type: "ReLU"
	  bottom: "ic12_hid"
	  top: "ic12_hid"
	}
	layer {
	  name: "ic12_out"
	  type: "Convolution"
	  bottom: "ic12_hid"
	  top: "ic12_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic12_out_relu"
	  type: "ReLU"
	  bottom: "ic12_out"
	  top: "ic12_out"
	}
	
#### layer 13 ####

	layer {
	  name: "ic13_in"
	  type: "Concat"
	  	bottom: 'ic10_out'
  		bottom: 'ic11_out'
  		bottom: 'ic12_hid'
  		bottom: 'ic12_out' 
	  top: "ic13_in"
	}
	layer {
	  name: "ic13_hid"
	  type: "Convolution"
	  bottom: "ic13_in"
	  top: "ic13_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic13_hid_relu"
	  type: "ReLU"
	  bottom: "ic13_hid"
	  top: "ic13_hid"
	}
	layer {
	  name: "ic13_out"
	  type: "Convolution"
	  bottom: "ic13_hid"
	  top: "ic13_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic13_out_relu"
	  type: "ReLU"
	  bottom: "ic13_out"
	  top: "ic13_out"
	}
	
#### layer 14 ####

	layer {
	  name: "ic14_in"
	  type: "Concat"
	  	bottom: 'ic11_out'
  		bottom: 'ic12_out'
  		bottom: 'ic13_hid'
  		bottom: 'ic13_out' 
	  top: "ic14_in"
	}
	layer {
	  name: "ic14_hid"
	  type: "Convolution"
	  bottom: "ic14_in"
	  top: "ic14_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic14_hid_relu"
	  type: "ReLU"
	  bottom: "ic14_hid"
	  top: "ic14_hid"
	}
	layer {
	  name: "ic14_out"
	  type: "Convolution"
	  bottom: "ic14_hid"
	  top: "ic14_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic14_out_relu"
	  type: "ReLU"
	  bottom: "ic14_out"
	  top: "ic14_out"
	}
	
#### layer 15 ####

	layer {
	  name: "ic15_in"
	  type: "Concat"
	  	bottom: 'ic12_out'
  		bottom: 'ic13_out'
  		bottom: 'ic14_hid'
  		bottom: 'ic14_out' 
	  top: "ic15_in"
	}
	layer {
	  name: "ic15_hid"
	  type: "Convolution"
	  bottom: "ic15_in"
	  top: "ic15_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic15_hid_relu"
	  type: "ReLU"
	  bottom: "ic15_hid"
	  top: "ic15_hid"
	}
	layer {
	  name: "ic15_out"
	  type: "Convolution"
	  bottom: "ic15_hid"
	  top: "ic15_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic15_out_relu"
	  type: "ReLU"
	  bottom: "ic15_out"
	  top: "ic15_out"
	}
	
#### layer 16 ####

	layer {
	  name: "ic16_in"
	  type: "Concat"
	  	bottom: 'ic13_out'
  		bottom: 'ic14_out'
  		bottom: 'ic15_hid'
  		bottom: 'ic15_out' 
	  top: "ic16_in"
	}
	layer {
	  name: "ic16_hid"
	  type: "Convolution"
	  bottom: "ic16_in"
	  top: "ic16_hid"
	  convolution_param {
	    num_output: 20
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic16_hid_relu"
	  type: "ReLU"
	  bottom: "ic16_hid"
	  top: "ic16_hid"
	}
	layer {
	  name: "ic16_out"
	  type: "Convolution"
	  bottom: "ic16_hid"
	  top: "ic16_out"
	  convolution_param {
	    num_output: 3
	    kernel_size: 3
	    pad: 1
	    weight_filler {
	      type: "xavier"
	    }
	  }
	}
	layer {
	  name: "ic16_out_relu"
	  type: "ReLU"
	  bottom: "ic16_out"
	  top: "ic16_out"
	}
	
#### layer 17 ####

layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "ic4_out"
  top: "ip1"
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "accuracy1"
  type: "Accuracy"
  bottom: "ip1"
  bottom: "label"
  top: "accuracy1"
  include {
    phase: TEST
  }
}
layer {
  name: "loss1"
  type: "SoftmaxWithLoss"
  bottom: "ip1"
  bottom: "label"
  top: "loss1"
}

layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ic8_out"
  top: "ip2"
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "accuracy2"
  type: "Accuracy"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy2"
  include {
    phase: TEST
  }
}
layer {
  name: "loss2"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss2"
}

layer {
  name: "ip3"
  type: "InnerProduct"
  bottom: "ic12_out"
  top: "ip3"
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "accuracy3"
  type: "Accuracy"
  bottom: "ip3"
  bottom: "label"
  top: "accuracy3"
  include {
    phase: TEST
  }
}
layer {
  name: "loss3"
  type: "SoftmaxWithLoss"
  bottom: "ip3"
  bottom: "label"
  top: "loss3"
}


layer {
  name: "ip4"
  type: "InnerProduct"
  bottom: "ic16_out"
  top: "ip4"
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "accuracy4"
  type: "Accuracy"
  bottom: "ip4"
  bottom: "label"
  top: "accuracy4"
  include {
    phase: TEST
  }
}
layer {
  name: "loss4"
  type: "SoftmaxWithLoss"
  bottom: "ip4"
  bottom: "label"
  top: "loss4"
}

