name: "RPi_23Nov2015"

layer {
  name: "data_0"
  type: "ImageData"
  top: "data_0"
  top: "label_0"
  transform_param {
    mirror: false
    mean_value: 115
    mean_value: 115
    mean_value: 115
  }
  image_data_param {
    source: "/Users/karlzipser/scratch/2015/11/23/train_0.txt"
    batch_size: 10
    shuffle: false
  }
}
layer {
  name: "data_1"
  type: "ImageData"
  top: "data_1"
  top: "label_1"
  transform_param {
    mirror: false
    mean_value: 115
    mean_value: 115
    mean_value: 115
  }
  image_data_param {
    source: "/Users/karlzipser/scratch/2015/11/23/train_1.txt"
    batch_size: 10
    shuffle: false
  }
}

layer {
  name: "data_2"
  type: "ImageData"
  top: "data_2"
  top: "label_2"
  transform_param {
    mirror: false
    mean_value: 115
    mean_value: 115
    mean_value: 115
  }
  image_data_param {
    source: "/Users/karlzipser/scratch/2015/11/23/train_2.txt"
    batch_size: 10
    shuffle: false
  }
}
layer {
  name: "data_3"
  type: "ImageData"
  top: "data_3"
  top: "label_3"
  transform_param {
    mirror: false
    mean_value: 115
    mean_value: 115
    mean_value: 115
  }
  image_data_param {
    source: "/Users/karlzipser/scratch/2015/11/23/train_3.txt"
    batch_size: 10
    shuffle: false
  }
}

layer {
  name: "data_4"
  type: "ImageData"
  top: "data_4"
  top: "label_4"
  transform_param {
    mirror: false
    mean_value: 115
    mean_value: 115
    mean_value: 115
  }
  image_data_param {
    source: "/Users/karlzipser/scratch/2015/11/23/train_4.txt"
    batch_size: 10
    shuffle: false
  }
}
layer {
  name: "data_5"
  type: "ImageData"
  top: "data_5"
  top: "label_5"
  transform_param {
    mirror: false
    mean_value: 115
    mean_value: 115
    mean_value: 115
  }
  image_data_param {
    source: "/Users/karlzipser/scratch/2015/11/23/train_5.txt"
    batch_size: 10
    shuffle: false
  }
}

layer {
  name: "data_6"
  type: "ImageData"
  top: "data_6"
  top: "label_6"
  transform_param {
    mirror: false
    mean_value: 115
    mean_value: 115
    mean_value: 115
  }
  image_data_param {
    source: "/Users/karlzipser/scratch/2015/11/23/train_6.txt"
    batch_size: 10
    shuffle: false
  }
}
layer {
  name: "data_7"
  type: "ImageData"
  top: "data_7"
  top: "label_7"
  transform_param {
    mirror: false
    mean_value: 115
    mean_value: 115
    mean_value: 115
  }
  image_data_param {
    source: "/Users/karlzipser/scratch/2015/11/23/train_7.txt"
    batch_size: 10
    shuffle: false
  }
}

layer {
  name: "data_8"
  type: "ImageData"
  top: "data_8"
  top: "label_8"
  transform_param {
    mirror: false
    mean_value: 115
    mean_value: 115
    mean_value: 115
  }
  image_data_param {
    source: "/Users/karlzipser/scratch/2015/11/23/train_8.txt"
    batch_size: 10
    shuffle: false
  }
}
layer {
  name: "data_9"
  type: "ImageData"
  top: "data_9"
  top: "label_9"
  transform_param {
    mirror: false
    mean_value: 115
    mean_value: 115
    mean_value: 115
  }
  image_data_param {
    source: "/Users/karlzipser/scratch/2015/11/23/train_9.txt"
    batch_size: 10
    shuffle: false
  }
}

layer {
  name: "data"
  type: "Concat"
    bottom: 'data_0'
    bottom: 'data_1'
    bottom: 'data_2'
    bottom: 'data_3'
    bottom: 'data_4'
    bottom: 'data_5'
    bottom: 'data_6'
    bottom: 'data_7'
    bottom: 'data_8'
    bottom: 'data_9'
  top: "data"
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}




layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 100
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}




layer {
  name: "fc8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8"
  bottom: "label_0"
  top: "loss"
}