# /home/karlzipser/kzpy3/caf6/z2_color_more
# Wednesday, 01 Feb 2017, 07:50:18 AM

layer {
	name: "steer_motor_target_data"
	type: "DummyData"
	top: "steer_motor_target_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 20
		}
	}
}

layer {
	name: "behavioral_mode"
	type: "DummyData"
	top: "behavioral_mode"
	dummy_data_param {
		shape {
			dim: 1
			dim: 20
			dim: 14
			dim: 26
		}
	}
}

layer {
	name: "xy_gradient_data"
	type: "DummyData"
	top: "xy_gradient_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 2
			dim: 14
			dim: 26
		}
	}
}
layer {
	name: "radar_data"
	type: "DummyData"
	top: "radar_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 120
			dim: 14
			dim: 26
		}
	}
}
layer {
	name: "lidar_data"
	type: "DummyData"
	top: "radar_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 180
			dim: 14
			dim: 26
		}
	}
}
layer {
	name: "steer_data"
	type: "DummyData"
	top: "steer_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 15
			dim: 14
			dim: 26
		}
	}
}
layer {
	name: "motor_data"
	type: "DummyData"
	top: "motor_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 15
			dim: 14
			dim: 26
		}
	}
}

layer {
	name: "ZED_data_pool2"
	type: "DummyData"
	top: "ZED_data_pool2"
	dummy_data_param {
		shape {
			dim: 1
			dim: 12
			dim: 94
			dim: 168
		}
	}
}
	

layer {
	name: "conv1"
	type: "Convolution"
	bottom: "ZED_data_pool2"
	top: "conv1"
	convolution_param {
		num_output: 96
		group: 1
		kernel_size: 11
		stride: 3
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.00001
		}
	}
}
	

layer {
	name: "conv1_relu"
	type: "ReLU"
	bottom: "conv1"
	top: "conv1"
}
	

layer {
	name: "conv1_pool"
	type: "Pooling"
	bottom: "conv1"
	top: "conv1_pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
	}
}
	
	

layer {
	type: 'Concat'
	name: 'conv1_metadata_concat'
	bottom: "conv1_pool"
	bottom: "behavioral_mode"
	bottom: "radar_data"
	bottom: "lidar_data"
	bottom: "steer_data"
	bottom: "motor_data"
	bottom: "xy_gradient_data"
	top: 'conv1_metadata_concat'
	concat_param {
		axis: 1
	}
}
	


layer {
	name: "nin1"
	type: "Convolution"
	bottom: "conv1_metadata_concat"
	top: "nin1"
	convolution_param {
		num_output: 200
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "nin1_relu"
	type: "ReLU"
	bottom: "nin1"
	top: "nin1"
}
layer {
	name: "nin2"
	type: "Convolution"
	bottom: "nin1"
	top: "nin2"
	convolution_param {
		num_output: 100
		group: 1
		kernel_size: 1
		stride: 1
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "nin2_relu"
	type: "ReLU"
	bottom: "nin2"
	top: "nin2"
}



layer {
	name: "conv2"
	type: "Convolution"
	bottom: "conv1_metadata_concat"
	top: "conv2"
	convolution_param {
		num_output: 256
		group: 2
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
	

layer {
	name: "conv2_relu"
	type: "ReLU"
	bottom: "conv2"
	top: "conv2"
}
	

layer {
	name: "conv2_pool"
	type: "Pooling"
	bottom: "conv2"
	top: "conv2_pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
	}
}
	
	

layer {
	name: "ip1"
	type: "InnerProduct"
	bottom: "conv2_pool"
	top: "ip1"
	inner_product_param {
		num_output: 512
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "ip1_relu"
	type: "ReLU"
	bottom: "ip1"
	top: "ip1"
}
	


	

layer {
	name: "ip2"
	type: "InnerProduct"
	bottom: "ip1"
	top: "ip2"
	inner_product_param {
		num_output: 20
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "euclidean"
	type: "EuclideanLoss"
	bottom: "steer_motor_target_data"
	bottom: "ip2"
	top: "euclidean"
	loss_weight: 1
}
	
