



layer {
	name: "steer_motor_target_data"
	type: "DummyData"
	top: "steer_motor_target_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 20
		}
	}
}






layer {
	name: "ZED_data_pool2_left"
	type: "DummyData"
	top: "ZED_data_pool2_left"
	dummy_data_param {
		shape {
			dim: 1
			dim: 3
			dim: 94
			dim: 168
		}
	}
}

layer {
	name: "ZED_data_pool2_right"
	type: "DummyData"
	top: "ZED_data_pool2_right"
	dummy_data_param {
		shape {
			dim: 1
			dim: 3
			dim: 94
			dim: 168
		}
	}
}


	



layer {
	name: "conv1_left"
	type: "Convolution"
	bottom: "ZED_data_pool2_left"
	top: "conv1_left"
	convolution_param {
		num_output: 48
		kernel_size: 11
		stride: 3
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "conv1_left_relu"
	type: "ReLU"
	bottom: "conv1_left"
	top: "conv1_left"
}

layer {
	name: "conv1_left_1x1a"
	type: "Convolution"
	bottom: "conv1_left"
	top: "conv1_left_1x1a"
	convolution_param {
		num_output: 48
		kernel_size: 1
		stride: 1
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "conv1_left_1x1a_relu"
	type: "ReLU"
	bottom: "conv1_left_1x1a"
	top: "conv1_left_1x1a"
}

layer {
	name: "conv1_left_1x1b"
	type: "Convolution"
	bottom: "conv1_left_1x1a"
	top: "conv1_left_1x1b"
	convolution_param {
		num_output: 48
		kernel_size: 1
		stride: 1
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "conv1_left_1x1b_relu"
	type: "ReLU"
	bottom: "conv1_left_1x1b"
	top: "conv1_left_1x1b"
}







layer {
	name: "conv1_right"
	type: "Convolution"
	bottom: "ZED_data_pool2_right"
	top: "conv1_right"
	convolution_param {
		num_output: 48
		kernel_size: 11
		stride: 3
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "conv1_right_relu"
	type: "ReLU"
	bottom: "conv1_right"
	top: "conv1_right"
}

layer {
	name: "conv1_right_1x1a"
	type: "Convolution"
	bottom: "conv1_right"
	top: "conv1_right_1x1a"
	convolution_param {
		num_output: 48
		kernel_size: 1
		stride: 1
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "conv1_right_1x1a_relu"
	type: "ReLU"
	bottom: "conv1_right_1x1a"
	top: "conv1_right_1x1a"
}

layer {
	name: "conv1_right_1x1b"
	type: "Convolution"
	bottom: "conv1_right_1x1a"
	top: "conv1_right_1x1b"
	convolution_param {
		num_output: 48
		kernel_size: 1
		stride: 1
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "conv1_right_1x1b_relu"
	type: "ReLU"
	bottom: "conv1_right_1x1b"
	top: "conv1_right_1x1b"
}


layer {
  name: "conv1_concat"
  type: "Concat"
  bottom: "conv1_right_1x1a"
  bottom: "conv1_right_1x1b"
  top: "conv1_concat"
  concat_param {
    axis: 1
  }
}



layer {
	name: "conv2"
	type: "Convolution"
	bottom: "conv1_concat"
	top: "conv2"
	convolution_param {
		num_output: 96
		kernel_size: 3
		stride: 2
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "conv2_relu"
	type: "ReLU"
	bottom: "conv2"
	top: "conv2"
}
layer {
	name: "metadata"
	type: "DummyData"
	top: "metadata"
	dummy_data_param {
		shape {
			dim: 1
			dim: 6
			dim: 13
			dim: 26
		}
	}
}
layer {
  name: "conv2_concat"
  type: "Concat"
  bottom: "conv2"
  bottom: "metadata"
  top: "conv2_concat"
  concat_param {
    axis: 1
  }
}

layer {
	name: "conv2_pool"
	type: "Pooling"
	bottom: "conv2_concat" #"conv2_1x1b"
	top: "conv2_pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad: 0
	}
}







layer {
	name: "conv3"
	type: "Convolution"
	bottom: "conv2_pool"
	top: "conv3"
	convolution_param {
		num_output: 256
		kernel_size: 3
		stride: 2
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "conv3_relu"
	type: "ReLU"
	bottom: "conv3"
	top: "conv3"
}


layer {
	name: "conv3_pool"
	type: "Pooling"
	bottom: "conv3"
	top: "conv3_pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad: 0
	}
}


###################### IP Layer Set 'ip1' ######################
#
layer {
	name: "ip1"
	type: "InnerProduct"
	bottom: "conv3_pool"
	top: "ip1"
	inner_product_param {
		num_output: 512
		weight_filler {
			type: "xavier" 
		}
	}
}
	
layer {
	name: "ip1_relu"
	type: "ReLU"
	bottom: "ip1"
	top: "ip1"
}
	
############################################################


###################### IP Layer Set 'ip2' ######################
#
layer {
	name: "ip2"
	type: "InnerProduct"
	bottom: "ip1"
	top: "ip2"
	inner_product_param {
		num_output: 20
		weight_filler {
			type: "xavier" 
		}
	}
}
	
#layer {
#	name: "ip2_relu"
#	type: "ReLU"
#	bottom: "ip2"
#	top: "ip2"
#}
	
############################################################


layer {
	name: "euclidean"
	type: "EuclideanLoss"
	bottom: "ip2"
	bottom: "steer_motor_target_data"
	top: "euclidean"
	loss_weight: 1
}
	
