



layer {
	name: "target_data"
	type: "DummyData"
	top: "target_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 200
		}
	}
}



layer {
	name: "metadata"
	type: "DummyData"
	top: "metadata"
	dummy_data_param {
		shape {
			dim: 1
			dim: 60
			dim: 14
			dim: 26
		}
	}
}



layer {
	name: "ZED_data_pool2_left"
	type: "DummyData"
	top: "ZED_data_pool2_left"
	dummy_data_param {
		shape {
			dim: 1
			dim: 3
			dim: 94
			dim: 168
		}
	}
}

layer {
	name: "ZED_data_pool2_right"
	type: "DummyData"
	top: "ZED_data_pool2_right"
	dummy_data_param {
		shape {
			dim: 1
			dim: 3
			dim: 94
			dim: 168
		}
	}
}


	



layer {
	name: "conv1_left"
	type: "Convolution"
	bottom: "ZED_data_pool2_left"
	top: "conv1_left"
	convolution_param {
		num_output: 48
		group: 1
		kernel_size: 11
		stride: 3
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "conv1_left_relu"
	type: "ReLU"
	bottom: "conv1_left"
	top: "conv1_left"
}


layer {
	name: "conv1_left_1x1a"
	type: "Convolution"
	bottom: "conv1_left"
	top: "conv1_left_1x1a"
	convolution_param {
		num_output: 48
		group: 1
		kernel_size: 1
		stride: 1
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "conv1_left_1x1a_relu"
	type: "ReLU"
	bottom: "conv1_left_1x1a"
	top: "conv1_left_1x1a"
}


layer {
	name: "conv1_left_1x1b"
	type: "Convolution"
	bottom: "conv1_left_1x1a"
	top: "conv1_left_1x1b"
	convolution_param {
		num_output: 48
		group: 1
		kernel_size: 1
		stride: 1
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
layer {
	name: "conv1_left_1x1b_relu"
	type: "ReLU"
	bottom: "conv1_left_1x1b"
	top: "conv1_left_1x1b"
}


