



layer {
	name: "steer_motor_target_data"
	type: "DummyData"
	top: "steer_motor_target_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 20
		}
	}
}


layer {
	name: "conv1_pool_PAST"
	type: "DummyData"
	top: "conv1_pool_PAST"
	dummy_data_param {
		shape {
			dim: 1
			dim: 96
			dim: 14
			dim: 26
		}
	}
}

layer {
	name: "conv1_pool_PRESENT"
	type: "DummyData"
	top: "conv1_pool_PRESENT"
	dummy_data_param {
		shape {
			dim: 1
			dim: 96
			dim: 14
			dim: 26
		}
	}
}




	
############################################################

layer {
  name: "conv1_time_concat"
  type: "Concat"
  bottom: "conv1_pool_PRESENT"
  bottom: "conv1_pool_PAST"
  top: "conv1_time_concat"
  concat_param {
    axis: 1
  }
}

layer {
	name: "conv1_2"
	type: "Convolution"
	bottom: "conv1_time_concat"
	top: "conv1_2"
	convolution_param {
		num_output: 96
		group: 1
		kernel_size: 1
		stride: 1
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
	
layer {
	name: "conv1_2_relu"
	type: "ReLU"
	bottom: "conv1_2"
	top: "conv1_2"
}
###################### Convolutional Layer Set 'conv2' ######################
#
layer {
	name: "conv2_2"
	type: "Convolution"
	bottom: "conv1_2"
	top: "conv2_2"
	convolution_param {
		num_output: 256
		group: 2
		kernel_size: 3
		stride: 2
		pad: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
	
layer {
	name: "conv2_2_relu"
	type: "ReLU"
	bottom: "conv2_2"
	top: "conv2_2"
}
	
layer {
	name: "conv2_2_pool"
	type: "Pooling"
	bottom: "conv2_2"
	top: "conv2_2_pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad: 0
	}
}
	
############################################################


###################### IP Layer Set 'ip1' ######################
#
layer {
	name: "ip1"
	type: "InnerProduct"
	bottom: "conv2_2_pool"
	top: "ip1"
	inner_product_param {
		num_output: 512
		weight_filler {
			type: "xavier" 
		}
	}
}
	
layer {
	name: "ip1_relu"
	type: "ReLU"
	bottom: "ip1"
	top: "ip1"
}
	
############################################################


###################### IP Layer Set 'ip2' ######################
#
layer {
	name: "ip2"
	type: "InnerProduct"
	bottom: "ip1"
	top: "ip2"
	inner_product_param {
		num_output: 20
		weight_filler {
			type: "xavier" 
		}
	}
}
	
layer {
	name: "ip2_relu"
	type: "ReLU"
	bottom: "ip2"
	top: "ip2"
}
	
############################################################


layer {
	name: "euclidean"
	type: "EuclideanLoss"
	bottom: "ip2"
	bottom: "steer_motor_target_data"
	top: "euclidean"
	loss_weight: 1
}
	
