# /home/karlzipser/kzpy3/caf6/z2_color_deconv
# Wednesday, 08 Feb 2017, 08:55:51 AM

layer {
	name: "steer_motor_target_data"
	type: "DummyData"
	top: "steer_motor_target_data"
	dummy_data_param {
		shape {
			dim: 1
			dim: 20
		}
	}
}
	

layer {
	name: "metadata"
	type: "DummyData"
	top: "metadata"
	dummy_data_param {
		shape {
			dim: 1
			dim: 6
			dim: 14
			dim: 26
		}
	}
}
	

layer {
	name: "ZED_data_pool2"
	type: "DummyData"
	top: "ZED_data_pool2"
	dummy_data_param {
		shape {
			dim: 1
			dim: 12
			dim: 94
			dim: 168
		}
	}
}
	

layer {
	name: "conv1"
	type: "Convolution"
	bottom: "ZED_data_pool2"
	top: "conv1"
	convolution_param {
		num_output: 96
		group: 1
		kernel_size: 11
		stride: 3
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.00001
		}
	}
}
	

layer {
	name: "conv1_relu"
	type: "ReLU"
	bottom: "conv1"
	top: "conv1"
}
	

layer {
	name: "conv1_pool"
	type: "Pooling"
	bottom: "conv1"
	top: "conv1_pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
	}
}
	

layer {
	name: "conv1_pool_drop"
	type: "Dropout"
	bottom: "conv1_pool"
	top: "conv1_pool"
	dropout_param {
		dropout_ratio: 0.0
	}
}
	

layer {
	name: "conv2"
	type: "Convolution"
	bottom: "conv1_pool"
	top: "conv2"
	convolution_param {
		num_output: 256
		group: 2
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
	

layer {
	name: "conv2_relu"
	type: "ReLU"
	bottom: "conv2"
	top: "conv2"
}
	

layer {
	name: "deconv2"
	type: "Deconvolution"
	bottom: "conv2"
	top: "deconv2"
	convolution_param {
		num_output: 256
		group: 1
		kernel_size: 8
		stride: 4
		pad_h: 0
		pad_w: 1
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
	

layer {
	name: "deconv2_relu"
	type: "ReLU"
	bottom: "deconv2"
	top: "deconv2"
}
	

layer {
	name: "deconv3"
	type: "Deconvolution"
	bottom: "deconv2"
	top: "deconv3"
	convolution_param {
		num_output: 96
		group: 1
		kernel_size: 9
		stride: 3
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
	

layer {
	name: "deconv3_relu"
	type: "ReLU"
	bottom: "deconv3"
	top: "deconv3"
}
	

layer {
	name: "conv1_"
	type: "Convolution"
	bottom: "deconv3"
	top: "conv1_"
	convolution_param {
		num_output: 96
		group: 1
		kernel_size: 11
		stride: 3
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
	

layer {
	name: "conv1__relu"
	type: "ReLU"
	bottom: "conv1_"
	top: "conv1_"
}
	

layer {
	name: "conv1__pool"
	type: "Pooling"
	bottom: "conv1_"
	top: "conv1__pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
	}
}
	

layer {
	name: "conv2_"
	type: "Convolution"
	bottom: "conv1__pool"
	top: "conv2_"
	convolution_param {
		num_output: 256
		group: 2
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.1
		}
	}
}
	

layer {
	name: "conv2__relu"
	type: "ReLU"
	bottom: "conv2_"
	top: "conv2_"
}
	

layer {
	name: "conv2__pool"
	type: "Pooling"
	bottom: "conv2_"
	top: "conv2__pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
	}
}
	

layer {
	name: "ip1"
	type: "InnerProduct"
	bottom: "conv2__pool"
	top: "ip1"
	inner_product_param {
		num_output: 512
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "ip1_relu"
	type: "ReLU"
	bottom: "ip1"
	top: "ip1"
}
	

layer {
	name: "ip1_drop"
	type: "Dropout"
	bottom: "ip1"
	top: "ip1"
	dropout_param {
		dropout_ratio: 0.0
	}
}
	

layer {
	name: "ip2"
	type: "InnerProduct"
	bottom: "ip1"
	top: "ip2"
	inner_product_param {
		num_output: 20
		weight_filler {
			type: "xavier" 
		}
	}
}
	

layer {
	name: "euclidean"
	type: "EuclideanLoss"
	bottom: "steer_motor_target_data"
	bottom: "ip2"
	top: "euclidean"
	loss_weight: 1
}
	
