# /Users/karlzipser/kzpy3/caf7/z3_color
# Monday, 06 Mar 2017, 08:01:45 PM

layer {
	name: "left_pool2"
	type: "DummyData"
	top: "left_pool2"
	dummy_data_param {
		shape {
			dim: 1
			dim: 12
			dim: 94
			dim: 168
		}
	}
}
	

layer {
	name: "right_pool2"
	type: "DummyData"
	top: "right_pool2"
	dummy_data_param {
		shape {
			dim: 1
			dim: 12
			dim: 94
			dim: 168
		}
	}
}
	

layer {
	name: "conv1_left"
	type: "Convolution"
	bottom: "left_pool2"
	top: "conv1_left"
	convolution_param {
		num_output: 48
		group: 1
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.00001
		}
	}
}
	

layer {
	name: "conv1_left_relu"
	type: "ReLU"
	bottom: "conv1_left"
	top: "conv1_left"
}
	

layer {
	name: "conv1_left_pool"
	type: "Pooling"
	bottom: "conv1_left"
	top: "conv1_left_pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
	}
}
	

layer {
	name: "conv1_left_pool_drop"
	type: "Dropout"
	bottom: "conv1_left_pool"
	top: "conv1_left_pool"
	dropout_param {
		dropout_ratio: 0.0
	}
}
	

layer {
	name: "conv1_right"
	type: "Convolution"
	bottom: "right_pool2"
	top: "conv1_right"
	convolution_param {
		num_output: 48
		group: 1
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.00001
		}
	}
}
	

layer {
	name: "conv1_right_relu"
	type: "ReLU"
	bottom: "conv1_right"
	top: "conv1_right"
}
	

layer {
	name: "conv1_right_pool"
	type: "Pooling"
	bottom: "conv1_right"
	top: "conv1_right_pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
	}
}
	

layer {
	name: "conv1_right_pool_drop"
	type: "Dropout"
	bottom: "conv1_right_pool"
	top: "conv1_right_pool"
	dropout_param {
		dropout_ratio: 0.0
	}
}
	

layer {
	type: 'Concat'
	name: 'conv1_concat'
	bottom: "conv1_left"
	bottom: "conv1_right"
	top: 'conv1_concat'
	concat_param {
		axis: 1
	}
}
		

layer {
	type: 'Concat'
	name: 'conv1_pool_concat'
	bottom: "conv1_left_pool"
	bottom: "conv1_right_pool"
	top: 'conv1_pool_concat'
	concat_param {
		axis: 1
	}
}
		

layer {
	name: "conv2a_bi"
	type: "Convolution"
	bottom: "conv1_concat"
	top: "conv2a_bi"
	convolution_param {
		num_output: 48
		group: 1
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.00001
		}
	}
}
	

layer {
	name: "conv2a_bi_relu"
	type: "ReLU"
	bottom: "conv2a_bi"
	top: "conv2a_bi"
}
	

layer {
	name: "conv2a_bi_pool"
	type: "Pooling"
	bottom: "conv2a_bi"
	top: "conv2a_bi_pool"
	pooling_param {
		pool: MAX
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
	}
}
	

layer {
	name: "conv2b_bi"
	type: "Convolution"
	bottom: "conv1_pool_concat"
	top: "conv2b_bi"
	convolution_param {
		num_output: 48
		group: 1
		kernel_size: 3
		stride: 2
		pad_h: 0
		pad_w: 0
		weight_filler {
			type: "gaussian" 
			std: 0.00001
		}
	}
}
	

layer {
	name: "conv2b_bi_relu"
	type: "ReLU"
	bottom: "conv2b_bi"
	top: "conv2b_bi"
}
	
